<?php
$x = [[1, 2, 3],
      [4, 5, 6],
      [7, 8, 9]];
//сумма всего массива, перебор по строкам
$s = 0;
for ($i=0; $i < 3; $i++) {
    for ($j=0; $j < 3; $j++) {
        $s += $x[$i][$j];
    }
}
echo $s, '<br>---<br>';
//сумма всего массива, перебор по столбцам
$s = 0;
for ($j=0; $j < 3; $j++) {
    for ($i=0; $i < 3; $i++) {
        $s += $x[$i][$j];
    }
}
echo $s, '<br>---<br>';
//сумма каждой строки
for ($i=0; $i < 3; $i++) {
    $s = 0;
    for ($j=0; $j < 3; $j++) {
        $s += $x[$i][$j];
    }
    echo $s, '<br>';
}
echo '---<br>';
//сумма каждого столбца
for ($j=0; $j < 3; $j++) {
    $s = 0;
    for ($i=0; $i < 3; $i++) {
        $s += $x[$i][$j];
    }
    echo $s, '<br>';
}
